# Shopify Internship Question

On Shopify, we have exactly 100 sneaker shops, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $3145.13. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis. 

Think about what could be going wrong with our calculation. 
Think about a better way to evaluate this data. 

What metric would you report for this dataset?

What is its value?

In [33]:
# Imports
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt

In [34]:
# Bring in CSV and create dataframe and call it df
csv_path = Path("Shopify_data.csv")

df = pd.read_csv(csv_path, infer_datetime_format=True, parse_dates=True, )
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [35]:
# turn the created_at column into a datetime column
df['created_at'] = pd.to_datetime(df['created_at'])

In [36]:
# making sure the column created_at is datetime
df.dtypes

order_id                   int64
shop_id                    int64
user_id                    int64
order_amount               int64
total_items                int64
payment_method            object
created_at        datetime64[ns]
dtype: object

In [37]:
# Identifying frequency counts of the nulls
df.isnull().sum()

order_id          0
shop_id           0
user_id           0
order_amount      0
total_items       0
payment_method    0
created_at        0
dtype: int64

In [38]:
# looking for duplicates
df.duplicated().sum()

0

In [39]:
# turning the shop_id, order_id, and user_id columns into strings because we won't be doing math with IDs
df['shop_id'] = df['shop_id'].astype('str')

df['order_id'] = df['order_id'].astype('str')

df['user_id'] = df['user_id'].astype('str')

df

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 04:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 04:35:11
...,...,...,...,...,...,...,...
4995,4996,73,993,330,2,debit,2017-03-30 13:47:17
4996,4997,48,789,234,2,cash,2017-03-16 20:36:16
4997,4998,56,867,351,3,cash,2017-03-19 05:42:42
4998,4999,60,825,354,2,credit_card,2017-03-16 14:51:18
4999,5000,44,734,288,2,debit,2017-03-18 15:48:18

In [40]:
# making sure the data types actually changed
df.dtypes

order_id                  object
shop_id                   object
user_id                   object
order_amount               int64
total_items                int64
payment_method            object
created_at        datetime64[ns]
dtype: object

In [41]:
# Sort the created_at column by ascending
df = df.sort_values("created_at", ascending=False) 
df.head(20)

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
2457,2458,95,700,168,1,credit_card,2017-03-30 23:55:35
317,318,52,848,292,2,cash,2017-03-30 23:41:34
1474,1475,21,815,142,1,cash,2017-03-30 23:26:54
1685,1686,34,818,244,2,cash,2017-03-30 23:16:10
2630,2631,53,940,112,1,credit_card,2017-03-30 23:12:13
57,58,51,759,187,1,cash,2017-03-30 22:34:47
972,973,90,752,178,1,cash,2017-03-30 22:04:13
276,277,49,777,129,1,cash,2017-03-30 21:49:13
4161,4162,36,925,260,2,cash,2017-03-30 21:31:54
3149,3150,67,754,393,3,debit,2017-03-30 21:31:11
3643,3644,41,764,472,4,debit,2017-03-30 21:26:50
3484,3485,87,892,149,1,cash,2017-03-30 21:22:10
4097,4098,67,837,393,3,debit,2017-03-30 21:20:10
3362,3363,86,831,130,1,debit,2017-03-30 21:19:09
9,10,52,788,146,1,credit_card,2017-03-30 21:08:26
702,703,60,958,177,1,credit_card,2017-03-30 20:46:29
3937,3938,63,857,272,2,cash,2017-03-30 20:21:38
4527,4528,54,935,266,2,debit,2017-03-30 20:18:21
20,21,66,987,322,2,cash,2017-03-30 20:11:59
3041,3042,93,894,228,2,debit,2017-03-30 20:10:27

In [58]:
# This is taking the mean of order amount column to get the 
# same AOV as the company originally did
df['order_amount'].mean()

3145.128

In [60]:
# I grabbed the maximum value here just to see larger values
# are skewing the mean, and I was right in my assumption
df['order_amount'].max()

704000

In [44]:
# seeing the largest date
df['created_at'].max()

Timestamp('2017-03-30 23:55:35')

In [46]:
# seeing the smallest date
# this helps us to know how much we need to slice to only get info for the 
# past 30 days

# it appears as though there is only 30 days worth of data here, which is nice
df['created_at'].min()

Timestamp('2017-03-01 00:08:09')

In [47]:
# Average Order Value(AOV) is calculated by dividing revenue by number of orders

# this sums up everything in the order_amount column and saves it as the variable, Total_order_amount.
# I am assuming order_amount is the cost of all items ordered, rounded to the nearest whole number
# because we also have a total_items column which tells us how many sneakers were purchased 
 
Total_order_amount = df['order_amount'].sum()
print (f'total order amount: {Total_order_amount}')

# this is sums up everything in the total_items column and 
# as the variable, Total_items
Total_items = df['total_items'].sum()
print (f'total items ordered: {Total_items}')

total order amount: 15725640
total items ordered: 43936

In [56]:
# This is displaying the result of dividing Total_order_amount by Total_items
# to get the AOV
print('The AOV of the past 30 days is: ')
print(Total_order_amount / Total_items )

The AOV of the past 30 days is:
357.92152221412965

## Think about what could be going wrong with our calculation. Think about a better way to evaluate this data. 

You originally just grabbed the mean which normally would be fine, but occasionally, you had >$70,000 orders, probably 
from large scale resellers.

## What metric would you report for this dataset?

I think the AOV the way I calculated it(revenue / number of orders) got an average that's pretty good for what we're
doing here. Another useful metric though would be to see the average amount of items sold. 

## What is its value?
That would probably confirm my hypothesis of having large scale resellers skewing the data.